let s =`Но представители современных социальных резервов, вне зависимости от их уровня, должны быть заблокированы в рамках своих собственных рациональных ограничений. Картельные сговоры не допускают ситуации, при которой тщательные исследования конкурентов объявлены нарушающими общечеловеческие нормы этики и морали.`
s = s.replace(/\./g,` ...`)
console.log(s)
//28. Написать метод, который в переданной строке заменяет все точки на многоточие. С его помощью обработать пять разных строк и отобразить их на экране