const q = [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35]
let w = []
q.forEach(z=>{
    if( z % 2 == 0 && z < 3 ){
        a = z + z
      
    w.push(a)
    }else if(z % 2 !=0 && z > 1 ){

    d = z * z
    w.push(d)
}
}
)
let s = w.reduce(function(g,f){
    return g + f
}
)
console.log(`Я не понел что нужно сделать`, s)
console.log(w)
//9. Дан массив Z целых чисел, содержащий 35 элементов. Вычислить и вывести R = S + P, где S – сумма четных элементов, меньших 3, P – произведение нечетных элементов, больших 1. 
//сума как без





